Show / Hide Table of Contents
Class ConcreteCheckResult
Concrete Check results
Inheritance
System.Object
ConcreteCheckResult
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteCheckResult
Constructors
Improve this Doc   View Source
ConcreteCheckResult()
Constructor
Declaration
public ConcreteCheckResult()
Properties
Improve this Doc   View Source
CheckResults
All results - first is extreme
Declaration
public List<ConcreteCheckResultBase> CheckResults { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConcreteCheckResultBase>
Improve this Doc   View Source
ResultType
Check result type
Declaration
public CheckResultType ResultType { get; set; }
Property Value
 Type |  Description
 CheckResultType
 Improve this Doc
 View Source